_sample_apps/books_app/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["memo", "b"], ["created_at", "2014-12-30 06:41:38.098176"], ["updated_at", "2014-12-30 06:41:38.098176"]]