_sample_apps/blog_app/app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT "entries".* FROM "entries"

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("title", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ccc"], ["description", "ccc"], ["picture", "bg-2014.png"], ["created_at", "2015-04-14 03:05:14.352006"], ["updated_at", "2015-04-14 03:05:14.352006"]]

    def set_entry
      @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ? LIMIT 1  [["id", 1]]